Python 3.13.2 (tags/v3.13.2:4f8bb39, Feb  4 2025, 15:23:48) [MSC v.1942 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> for i in range(0, 3, 1) :
...     print("연습용 코드")
... 
...     
연습용 코드
연습용 코드
연습용 코드
>>> cd C:/CookData/for.py
SyntaxError: invalid syntax
>>> cd c:/CookData/for.py
SyntaxError: invalid syntax
>>> cd C:\/CookData/for.py
SyntaxError: invalid syntax
>>> cd CookData/for.py
SyntaxError: invalid syntax
>>> for i in range(0, 100, 1):
...     print("%d 안녕하세요? for문을 공부중입니다." i)
...     
SyntaxError: invalid syntax. Perhaps you forgot a comma?
>>> for i in range(0, 100, 1):
...     print(%d "안녕하세요? for문을 공부중입니다." i)
...     
SyntaxError: invalid syntax
>>> for i in range(0, 100, 1):
...     print("%d 안녕하세요? for문을 공부중입니다. " %i)
... 
...     
0 안녕하세요? for문을 공부중입니다. 
1 안녕하세요? for문을 공부중입니다. 
2 안녕하세요? for문을 공부중입니다. 
3 안녕하세요? for문을 공부중입니다. 
4 안녕하세요? for문을 공부중입니다. 
5 안녕하세요? for문을 공부중입니다. 
6 안녕하세요? for문을 공부중입니다. 
7 안녕하세요? for문을 공부중입니다. 
8 안녕하세요? for문을 공부중입니다. 
9 안녕하세요? for문을 공부중입니다. 
10 안녕하세요? for문을 공부중입니다. 
11 안녕하세요? for문을 공부중입니다. 
12 안녕하세요? for문을 공부중입니다. 
13 안녕하세요? for문을 공부중입니다. 
14 안녕하세요? for문을 공부중입니다. 
15 안녕하세요? for문을 공부중입니다. 
16 안녕하세요? for문을 공부중입니다. 
17 안녕하세요? for문을 공부중입니다. 
18 안녕하세요? for문을 공부중입니다. 
19 안녕하세요? for문을 공부중입니다. 
20 안녕하세요? for문을 공부중입니다. 
21 안녕하세요? for문을 공부중입니다. 
22 안녕하세요? for문을 공부중입니다. 
23 안녕하세요? for문을 공부중입니다. 
24 안녕하세요? for문을 공부중입니다. 
25 안녕하세요? for문을 공부중입니다. 
26 안녕하세요? for문을 공부중입니다. 
27 안녕하세요? for문을 공부중입니다. 
28 안녕하세요? for문을 공부중입니다. 
29 안녕하세요? for문을 공부중입니다. 
30 안녕하세요? for문을 공부중입니다. 
31 안녕하세요? for문을 공부중입니다. 
32 안녕하세요? for문을 공부중입니다. 
33 안녕하세요? for문을 공부중입니다. 
34 안녕하세요? for문을 공부중입니다. 
35 안녕하세요? for문을 공부중입니다. 
36 안녕하세요? for문을 공부중입니다. 
37 안녕하세요? for문을 공부중입니다. 
38 안녕하세요? for문을 공부중입니다. 
39 안녕하세요? for문을 공부중입니다. 
40 안녕하세요? for문을 공부중입니다. 
41 안녕하세요? for문을 공부중입니다. 
42 안녕하세요? for문을 공부중입니다. 
43 안녕하세요? for문을 공부중입니다. 
44 안녕하세요? for문을 공부중입니다. 
45 안녕하세요? for문을 공부중입니다. 
46 안녕하세요? for문을 공부중입니다. 
47 안녕하세요? for문을 공부중입니다. 
48 안녕하세요? for문을 공부중입니다. 
49 안녕하세요? for문을 공부중입니다. 
50 안녕하세요? for문을 공부중입니다. 
51 안녕하세요? for문을 공부중입니다. 
52 안녕하세요? for문을 공부중입니다. 
53 안녕하세요? for문을 공부중입니다. 
54 안녕하세요? for문을 공부중입니다. 
55 안녕하세요? for문을 공부중입니다. 
56 안녕하세요? for문을 공부중입니다. 
57 안녕하세요? for문을 공부중입니다. 
58 안녕하세요? for문을 공부중입니다. 
59 안녕하세요? for문을 공부중입니다. 
60 안녕하세요? for문을 공부중입니다. 
61 안녕하세요? for문을 공부중입니다. 
62 안녕하세요? for문을 공부중입니다. 
63 안녕하세요? for문을 공부중입니다. 
64 안녕하세요? for문을 공부중입니다. 
65 안녕하세요? for문을 공부중입니다. 
66 안녕하세요? for문을 공부중입니다. 
67 안녕하세요? for문을 공부중입니다. 
68 안녕하세요? for문을 공부중입니다. 
69 안녕하세요? for문을 공부중입니다. 
70 안녕하세요? for문을 공부중입니다. 
71 안녕하세요? for문을 공부중입니다. 
72 안녕하세요? for문을 공부중입니다. 
73 안녕하세요? for문을 공부중입니다. 
74 안녕하세요? for문을 공부중입니다. 
75 안녕하세요? for문을 공부중입니다. 
76 안녕하세요? for문을 공부중입니다. 
77 안녕하세요? for문을 공부중입니다. 
78 안녕하세요? for문을 공부중입니다. 
79 안녕하세요? for문을 공부중입니다. 
80 안녕하세요? for문을 공부중입니다. 
81 안녕하세요? for문을 공부중입니다. 
82 안녕하세요? for문을 공부중입니다. 
83 안녕하세요? for문을 공부중입니다. 
84 안녕하세요? for문을 공부중입니다. 
85 안녕하세요? for문을 공부중입니다. 
86 안녕하세요? for문을 공부중입니다. 
87 안녕하세요? for문을 공부중입니다. 
88 안녕하세요? for문을 공부중입니다. 
89 안녕하세요? for문을 공부중입니다. 
90 안녕하세요? for문을 공부중입니다. 
91 안녕하세요? for문을 공부중입니다. 
92 안녕하세요? for문을 공부중입니다. 
93 안녕하세요? for문을 공부중입니다. 
94 안녕하세요? for문을 공부중입니다. 
95 안녕하세요? for문을 공부중입니다. 
96 안녕하세요? for문을 공부중입니다. 
97 안녕하세요? for문을 공부중입니다. 
98 안녕하세요? for문을 공부중입니다. 
99 안녕하세요? for문을 공부중입니다. 
